{
  "projects": [
    {
      "id":1,
      "product": "UNISYS InfoImage Enterprise Content Manager",
      "company": "NTTDATA",
      "client": "UNISYS",
      "duration": "2012-2014",
      "designation": "Software Engineer",
      "responsibilities": "Gained exposure in the end-to-end development of software products from requirement analysis to system study, designing, coding, testing and debugging. Interacting with clients for requirements & designing. Handled a complete range of project activities right from conceptualization, testing, and maintenance. Conducted Case / System / Process Study for project planning, scoping, estimation, tracking. Responsible for Client interaction, defect tracking, work allocation, estimation, risk mitigation, Time reporting and working with quality assurance teams. Delivered and implemented the project as per scheduled milestones. Supervised smooth Implementation of the project and extending post-implementation, application maintenance, and technical support to end users",
      "link": "https://www.unisys.com/offerings/industry-solutions/infoimage",
      "imageLink": "unisys-header-image",
      "technology": [
        "C#",
        "VBA",
        "Infragistics 12.0",
        "Sharepoint 2010",
        ".NET 3.5",
        ".NET 4.0",
        "InfoPath 2010",
        "ABBYY API",
        "Windows Service",
        "DCOM",
        "VB.NET",
        "WebForms",
        ".NET MVC",
        "ExtJS",
        "IBM Clearcase"
      ],
      "description": "Unisys InfoImage is an Enterprise Content Management (ECM) platform with integrated Business Process Management (BPM/workflow) and Records Management (RM) that is ideally suited for business-critical applications that involve high document volumes arriving as paper, electronic files, digital assets, and internet transactions."
    },
    {
      "id":2,
      "product": "DeltaX Adbox Pro",
      "company": "DeltaX",
      "client": "DeltaX",
      "duration": "2014-2017",
      "designation": "Senior Product Developer / Tracking Team Lead",
      "responsibilities": "Working as Tracking Team Lead for DeltaX. Developing Applications to aid users in various application areas using.NET(4.5), Entity Framework(5.0), ASP.Net MVC 4, Windows Service, WCF, SQL Server 2008 (Tentative DB Architecture), Bootstrap, Jquery, Ext JS, Amazon S3, Kinesis, APIs - Facebook, Bing, Adwords, Tortoise SVN, Deployment – Jenkins and Development Framework – Scrum. Meeting the SLA’s set by the client, Working with the project team and the client for establishing achievable requirements. Demonstrated proficiency in Quality processes followed through the complete software development lifecycle of Project. Deftly coordinate with onsite for timely delivery of project & query resolutions. Direct support to the Software Development department in the areas of software/application architecture, development, design, and independent analysis and problem resolution",
      "link": "https://www.deltax.com/",
      "imageLink": "deltax-header-image",
      "technology": [
        "C#",
        ".NET 4.0",
        ".NET 4.5",
        "SignalR",
        "Redis",
        "AZURE",
        "AZURE Migration",
        "Azure-AppService",
        "Azure-SQL Server",
        "SQL Server",
        "Dapper",
        "Azure-ElasticPool",
        "Bootstrap",
        "WebApi",
        "AdTech Attribution",
        "Clicks/Views/Conversion Processing",
        "AWS S3",
        "SPARK",
        "AWS Lambda",
        "Jenkins",
        "AWS DynamoDB",
        "AWS EC2",
        "BitBucket"
      ],
      "description": "DeltaX is the pioneering cross-channel digital advertising platform. The company helps ad agencies and performance marketers buy, track, attribute, optimize and report media across Search, Social, Display, Mobile and Video ads more efficiently by taking a unified data and automation driven approach. The cloud-based platform leverages big data, user behavior and machine learning algorithms to improve performance across the business funnel of advertisers."
    },
    {
      "id":3,
      "product": "OPTUM Impact Pro",
      "company": "OPTUM",
      "client": "OPTUM",
      "duration": "2017-2019",
      "designation": "Senior Software Engineer",
      "responsibilities": "Working as Individual Contributor in OPTUM Impact Pro Health Care Project. Quick learner , I was able to bring new features/suggestions by understanding the product within a small interval of time. Developed/Enhanced Projects modules irrespective of Tech stacks. Major contribution towards MVC, ASP.NET, WEB API, EF. Revamped existing DB setup completely, introduced Fluent Migrator DB setup (Any DB at any time with just one click in Jenkins job). Also played crucial part of Cloud integration Research for Impact Pro projects. DB on AWS/AZURE instance, Deployable package AWS/AZURE instance (using Web Deploy 3.5 + python scripts). Designed/implemented EPICs (those EPICS were on backlog for a long time (5+ years). Always thought about solution, not for the technology stacks.",
      "link": "https://www.optum.com/solutions/health-plans/deliver-actionable-clinical-analytics/impact-pro.html",
      "imageLink": "optum-header-image",
      "technology": [
        "C#",
        ".NET 4.0",
        ".NET 4.5",
        "Clinical Analytics",
        "MVC",
        "SalesFoce Integration",
        "SpecFlow",
        "Azure Integration",
        "Jenkins",
        "Fluent DB Migration",
        "Telerik/KendoUI Dashboard Integration",
        "Github Enterprise"
      ],
      "description": "Impact Pro® helps care managers evaluate members' current intervention programs to discover opportunities to maximize intervention efficacy. Target services to eliminate gaps in care. Improve the accuracy of analytic results. Better assess individual and population risk."
    },
    {
      "id": 4,
      "product": "BOSCH",
      "company": "BOSCH",
      "client": "BOSCH",
      "duration": "Freelance Work",
      "designation": "Freelance Developer",
      "responsibilities": "Requirements gathering, Implemented Wireframes. Integrated Application with ACCESS Database. Windows Desktop Application with dynamic TV size.",
      "link": "https://www.optum.com/solutions/health-plans/deliver-actionable-clinical-analytics/impact-pro.html",
      "imageLink": "bosch-header-image",
      "technology": [
        "C#",
        ".NET 4.0",
        "Windows-Desltop",
        "Windows-Forms",
        "Access Database",
        "MS Access 2013"
      ],
      "description": "Inventory TV Display Application to recurringly show/alert/status of items in the BOSCH Innventory"
    }
  ]
}
